marcelinoandrade/ExpertOnDevice-AI/firmware/esp32_p4_firmware/components/app/src/app_storage.c
#include "app_storage.h"

#include "bsp/esp32_p4_eye.h"
#include "esp_heap_caps.h"
#include "esp_log.h"
#include "freertos/FreeRTOS.h"
#include "freertos/queue.h"
#include "freertos/semphr.h"
#include "freertos/task.h"
#include "freertos/timers.h"
#include <errno.h>
#include <stdio.h>
#include <string.h>
#include <sys/stat.h>
#include <time.h>

static const char *TAG = "app_storage";

// Track SD card mount state
static bool s_sd_mounted = false;

// PSRAM buffer for queued JPEG images (to avoid SDMMC conflicts during network
// I/O)
#define MAX_QUEUED_IMAGES 2        // Reduced to 2 for easier testing
#define MAX_JPEG_SIZE (256 * 1024) // 256KB max per image
#define INACTIVITY_TIMEOUT_MS                                                  \
  (10 * 1000) // 10 seconds of inactivity before saving
#define MIN_QUEUE_FOR_IMMEDIATE_SAVE                                           \
  1 // Save immediately if queue is almost full (1 of 2)

typedef struct {
  uint8_t *data; // Allocated in PSRAM
  size_t len;
  bool valid;
  time_t timestamp; // When image was queued
} queued_image_t;

static queued_image_t s_image_queue[MAX_QUEUED_IMAGES];
static int s_queue_head = 0;
static int s_queue_tail = 0;
static int s_queue_count = 0;

// Task and synchronization for opportunistic saving
static TaskHandle_t s_save_task_handle = NULL;
static TimerHandle_t s_inactivity_timer = NULL;
static bool s_save_task_running = false;
static SemaphoreHandle_t s_sd_mount_mutex =
    NULL; // Protect SD mount/unmount operations
static SemaphoreHandle_t s_queue_mutex =
    NULL; // Protect queued image ring buffer
static volatile bool s_storage_busy = false;
static bool s_mount_after_camera_attempted = false;

// Directory paths
#define SD_BASE_PATH "/sdcard"
#define SD_MEDIA_PATH SD_BASE_PATH "/media"
#define SD_IMAGES_PATH SD_MEDIA_PATH "/images"

/**
 * @brief Create directory if it doesn't exist
 */
static esp_err_t create_directory_if_not_exists(const char *path) {
  struct stat st = {0};
  if (stat(path, &st) == 0) {
    if (S_ISDIR(st.st_mode)) {
      return ESP_OK;
    } else {
      ESP_LOGE(TAG, "Path exists but is not a directory: %s", path);
      return ESP_FAIL;
    }
  }

  // Directory doesn't exist, create it
  if (mkdir(path, 0755) != 0) {
    ESP_LOGE(TAG, "Failed to create directory '%s' (errno: %d, %s)", path,
             errno, strerror(errno));
    return ESP_FAIL;
  }

  ESP_LOGI(TAG, "Created directory: %s", path);
  return ESP_OK;
}

/**
 * @brief Ensure all required directories exist
 */
static esp_err_t ensure_directory_structure(void) {
  esp_err_t ret = ESP_OK;

  ret = create_directory_if_not_exists(SD_MEDIA_PATH);
  if (ret != ESP_OK)
    return ret;

  ret = create_directory_if_not_exists(SD_IMAGES_PATH);
  if (ret != ESP_OK)
    return ret;

  ret = create_directory_if_not_exists(SD_MEDIA_PATH "/audio");
  if (ret != ESP_OK)
    return ret;

  ret = create_directory_if_not_exists(SD_BASE_PATH "/logs");
  if (ret != ESP_OK)
    return ret;

  ret = create_directory_if_not_exists(SD_BASE_PATH "/logs/chat");
  if (ret != ESP_OK)
    return ret;

  ret = create_directory_if_not_exists(SD_BASE_PATH "/data");
  if (ret != ESP_OK)
    return ret;

  ESP_LOGI(TAG, "Directory structure verified");
  return ESP_OK;
}

/**
 * @brief Validate JPEG data integrity
 */
static bool validate_jpeg(const uint8_t *data, size_t len) {
  if (len < 4) {
    return false;
  }

  // Check JPEG start marker (FF D8)
  if (data[0] != 0xFF || data[1] != 0xD8) {
    return false;
  }

  // Check JPEG end marker (FF D9) - best effort
  if (len >= 2 && data[len - 2] == 0xFF && data[len - 1] == 0xD9) {
    return true;
  }

  // If no end marker, still accept if it starts correctly
  // (some JPEGs might be truncated in transmission)
  return true;
}

// Forward declaration
static void app_storage_process_queue_internal(void);

static int app_queue_count_locked(void) { return s_queue_count; }

static int app_queue_get_count(void) {
  if (s_queue_mutex == NULL) {
    return 0;
  }
  if (xSemaphoreTake(s_queue_mutex, pdMS_TO_TICKS(100)) != pdTRUE) {
    return 0;
  }
  int count = app_queue_count_locked();
  xSemaphoreGive(s_queue_mutex);
  return count;
}

static void app_queue_clear(void) {
  if (s_queue_mutex == NULL) {
    return;
  }
  if (xSemaphoreTake(s_queue_mutex, pdMS_TO_TICKS(1000)) != pdTRUE) {
    return;
  }
  while (s_queue_count > 0) {
    if (s_image_queue[s_queue_head].valid && s_image_queue[s_queue_head].data) {
      free(s_image_queue[s_queue_head].data);
      s_image_queue[s_queue_head].data = NULL;
    }
    s_image_queue[s_queue_head].len = 0;
    s_image_queue[s_queue_head].timestamp = 0;
    s_image_queue[s_queue_head].valid = false;
    s_queue_head = (s_queue_head + 1) % MAX_QUEUED_IMAGES;
    s_queue_count--;
  }
  s_queue_head = 0;
  s_queue_tail = 0;
  xSemaphoreGive(s_queue_mutex);
}

static bool app_queue_pop(queued_image_t *out_item) {
  if (!out_item || s_queue_mutex == NULL) {
    return false;
  }
  if (xSemaphoreTake(s_queue_mutex, pdMS_TO_TICKS(1000)) != pdTRUE) {
    return false;
  }
  if (s_queue_count == 0) {
    xSemaphoreGive(s_queue_mutex);
    return false;
  }

  *out_item = s_image_queue[s_queue_head];
  s_image_queue[s_queue_head].data = NULL;
  s_image_queue[s_queue_head].len = 0;
  s_image_queue[s_queue_head].timestamp = 0;
  s_image_queue[s_queue_head].valid = false;
  s_queue_head = (s_queue_head + 1) % MAX_QUEUED_IMAGES;
  s_queue_count--;

  xSemaphoreGive(s_queue_mutex);
  return true;
}

/**
 * @brief Timer callback for inactivity detection
 */
static void inactivity_timer_callback(TimerHandle_t xTimer) {
  (void)xTimer;
  // Notify save task that inactivity period has elapsed
  if (s_save_task_handle != NULL) {
    xTaskNotifyGive(s_save_task_handle);
  }
}

/**
 * @brief Task for opportunistic SD card saving
 *
 * This task monitors inactivity and saves queued images when:
 * 1. User has been inactive for INACTIVITY_TIMEOUT_MS
 * 2. Queue is almost full (MIN_QUEUE_FOR_IMMEDIATE_SAVE)
 *
 * This ensures SD card is only accessed when system is idle,
 * avoiding DMA conflicts with network/camera operations.
 */
static void opportunistic_save_task(void *pvParameters) {
  ESP_LOGI(TAG, "Opportunistic save task started");

  while (1) {
    // Wait for notification (inactivity timer or queue full)
    uint32_t notification = ulTaskNotifyTake(pdTRUE, portMAX_DELAY);

