marcelinoandrade/ExpertOnDevice-AI/firmware/esp32_p4_firmware/components/app/src/app_storage.c
    if (notification == 0) {
      continue;
    }

    // Check if we have images to save
    const int queued_now = app_queue_get_count();
    if (queued_now <= 0) {
      continue;
    }

    // Check if queue is almost full - save immediately
    bool immediate_save = (queued_now >= MIN_QUEUE_FOR_IMMEDIATE_SAVE);

    if (immediate_save) {
      ESP_LOGI(TAG, "Queue almost full (%d/%d), saving immediately", queued_now,
               MAX_QUEUED_IMAGES);
    } else {
      ESP_LOGI(TAG, "Inactivity detected, saving %d queued images", queued_now);
    }

    // Process queue (mount, save all, unmount)
    app_storage_process_queue_internal();
  }
}

/**
 * @brief Internal function to process queue (called by task)
 */
static void app_storage_process_queue_internal(void) {
  s_storage_busy = true;

  const int pending = app_queue_get_count();
  if (pending <= 0) {
    s_storage_busy = false;
    return; // Nothing to process
  }

  if (!bsp_sdcard_is_present()) {
    ESP_LOGW(TAG, "SD card not present, clearing %d queued images", pending);
    app_queue_clear();
    s_storage_busy = false;
    return;
  }

  ESP_LOGI(TAG, "Processing %d queued images (system idle, optimal timing)",
           pending);

  if (s_sd_mount_mutex == NULL) {
    ESP_LOGW(TAG, "SD mount mutex not initialized, skipping save attempt");
    s_storage_busy = false;
    return;
  }

  // Tenta adquirir mutex com timeout curto para nao bloquear LVGL task.
  // Se nao conseguir, reagenda via timer e retorna imediatamente.
  if (xSemaphoreTake(s_sd_mount_mutex, pdMS_TO_TICKS(200)) != pdTRUE) {
    ESP_LOGW(TAG, "Failed to acquire SD mount mutex, rescheduling");
    if (s_inactivity_timer != NULL) {
      xTimerStart(s_inactivity_timer, 0);
    }
    s_storage_busy = false;
    return;
  }

  // Verifica memoria DMA disponivel ANTES de tentar montar.
  // Nao faz vTaskDelay aqui - isso bloquearia o sistema inteiro.
  size_t free_heap = esp_get_free_heap_size();
  size_t free_internal = esp_get_free_internal_heap_size();
  size_t largest_block =
      heap_caps_get_largest_free_block(MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT);
  size_t largest_dma = heap_caps_get_largest_free_block(
      MALLOC_CAP_INTERNAL | MALLOC_CAP_DMA | MALLOC_CAP_8BIT);

  ESP_LOGI(TAG,
           "Memory before SD mount: Total=%u, Internal=%u, Largest=%u, "
           "LargestDMA=%u",
           (unsigned)free_heap, (unsigned)free_internal,
           (unsigned)largest_block, (unsigned)largest_dma);

  // Requer pelo menos 24KB contiguos DMA para o FATFS/SDMMC.
  const size_t min_dma_required = 24 * 1024;

  ESP_LOGI(TAG,
           "DMA memory diagnostic: LargestDMA=%u bytes, Internal=%u bytes, "
           "LargestBlock=%u bytes (non-DMA)",
           (unsigned)largest_dma, (unsigned)free_internal,
           (unsigned)largest_block);

  if (largest_dma < min_dma_required) {
    ESP_LOGW(TAG,
             "Insufficient DMA memory for SD mount: %u bytes (need %u). "
             "Will retry later. Queue: %d images",
             (unsigned)largest_dma, (unsigned)min_dma_required,
             app_queue_get_count());
    xSemaphoreGive(s_sd_mount_mutex);
    // Reagenda com timer para tentar novamente mais tarde
    if (s_inactivity_timer != NULL) {
      xTimerStart(s_inactivity_timer, 0);
    }
    s_storage_busy = false;
    return;
  }

  ESP_LOGI(TAG, "Sufficient DMA memory available: %u bytes (need %u)",
           (unsigned)largest_dma, (unsigned)min_dma_required);

  // Monta SD somente se ainda nao estiver montado.
  // NUNCA desmonta/remonta: ciclos de mount/unmount fragmentam a memoria
  // interna DMA e levam ao ESP_ERR_NO_MEM na proxima tentativa.
  if (!s_sd_mounted) {
    ESP_LOGI(TAG, "Mounting SD card (1-bit, DEFAULT freq)");
    esp_err_t mount_ret = bsp_sdcard_mount();

    if (mount_ret != ESP_OK) {
      ESP_LOGW(TAG, "Failed to mount SD: %s. Queue: %d images remain",
               esp_err_to_name(mount_ret), app_queue_get_count());
      xSemaphoreGive(s_sd_mount_mutex);
      // Reagenda para tentar novamente
      if (s_inactivity_timer != NULL) {
        xTimerStart(s_inactivity_timer, 0);
      }
      s_storage_busy = false;
      return;
    }

    s_sd_mounted = true;
    ensure_directory_structure();
    ESP_LOGI(TAG, "SD card mounted successfully (will remain mounted)");
  } else {
    ESP_LOGI(TAG, "SD card already mounted, proceeding to save");
    ensure_directory_structure();
  }

  // Processa fila: salva todas as imagens
  int saved_count = 0;
  int failed_count = 0;

  queued_image_t image_item = {0};
  while (app_queue_pop(&image_item)) {
    if (!image_item.valid || !image_item.data || image_item.len == 0) {
      continue;
    }

    esp_err_t save_ret =
        app_storage_save_image(image_item.data, image_item.len);
    if (save_ret == ESP_OK) {
      saved_count++;
    } else {
      failed_count++;
      ESP_LOGW(TAG, "Failed to save queued image: %s",
               esp_err_to_name(save_ret));
    }

    // Libera buffer PSRAM
    free(image_item.data);
    image_item.data = NULL;
    image_item.valid = false;
    image_item.len = 0;
  }

  ESP_LOGI(TAG, "Batch save complete (SD kept mounted): %d saved, %d failed",
           saved_count, failed_count);

  xSemaphoreGive(s_sd_mount_mutex);

  ESP_LOGI(TAG, "Storage queue flush finished");
  s_storage_busy = false;
}

esp_err_t app_storage_init(void) {
  ESP_LOGI(TAG, "Initializing storage subsystem with opportunistic saving");

  // Initialize SD card detection
  esp_err_t ret = bsp_sdcard_detect_init();
  if (ret != ESP_OK) {
    ESP_LOGE(TAG, "Failed to initialize SD card detection: %s",
             esp_err_to_name(ret));
    return ret;
  }

  // Initialize SD card detection only
  // Mount will happen opportunistically when system is idle
  if (bsp_sdcard_is_present()) {
    ESP_LOGI(TAG, "SD card detected (will save opportunistically when idle)");
  } else {
    ESP_LOGI(TAG, "SD card not present");
  }

  // Create mutex to protect SD mount/unmount operations
  s_sd_mount_mutex = xSemaphoreCreateMutex();
  if (s_sd_mount_mutex == NULL) {
    ESP_LOGE(TAG, "Failed to create SD mount mutex");
    return ESP_ERR_NO_MEM;
  }

