marcelinoandrade/ExpertOnDevice-AI/firmware/esp32_p4_firmware/components/app/src/app_storage.c
  // Create opportunistic save task (low priority, runs when idle)
  if (xTaskCreate(opportunistic_save_task, "save_task",
                  8192, // Stack size (SD/FATFS path needs more stack)
                  NULL,
                  2, // Low priority (below camera/network tasks)
                  &s_save_task_handle) != pdPASS) {
    ESP_LOGE(TAG, "Failed to create opportunistic save task");
    return ESP_ERR_NO_MEM;
  }

  // Create inactivity timer
  s_inactivity_timer =
      xTimerCreate("inactivity_timer", pdMS_TO_TICKS(INACTIVITY_TIMEOUT_MS),
                   pdFALSE, // One-shot (will be reset on interaction)
                   NULL, inactivity_timer_callback);

  if (s_inactivity_timer == NULL) {
    ESP_LOGE(TAG, "Failed to create inactivity timer");
    return ESP_ERR_NO_MEM;
  }

  s_queue_mutex = xSemaphoreCreateMutex();
  if (s_queue_mutex == NULL) {
    ESP_LOGE(TAG, "Failed to create queue mutex");
    return ESP_ERR_NO_MEM;
  }

  // Start the timer (will be reset on each interaction)
  xTimerStart(s_inactivity_timer, 0);

  s_save_task_running = true;
  ESP_LOGI(
      TAG,
      "Opportunistic save system initialized (saves after %d ms inactivity)",
      INACTIVITY_TIMEOUT_MS);

  return ESP_OK;
}

void app_storage_mount_after_camera_init(void) {
  // Mount once after camera path is alive. This avoids boot-time conflict
  // with esp_video device registration while still reducing runtime mount
  // failures caused by fragmented heap.
  if (s_mount_after_camera_attempted || s_sd_mounted) {
    return;
  }
  s_mount_after_camera_attempted = true;

  if (!bsp_sdcard_is_present()) {
    ESP_LOGD(TAG, "SD not present after camera init");
    return;
  }
  if (s_sd_mount_mutex == NULL) {
    ESP_LOGW(TAG, "SD mount mutex unavailable after camera init");
    return;
  }
  if (xSemaphoreTake(s_sd_mount_mutex, pdMS_TO_TICKS(2000)) != pdTRUE) {
    ESP_LOGW(TAG, "Could not acquire SD mutex after camera init");
    return;
  }

  if (!s_sd_mounted) {
    esp_err_t ret = bsp_sdcard_mount();
    if (ret == ESP_OK) {
      s_sd_mounted = true;
      (void)ensure_directory_structure();
      ESP_LOGI(TAG, "SD mounted after camera init (kept mounted)");
    } else {
      ESP_LOGW(TAG, "SD mount after camera init failed: %s",
               esp_err_to_name(ret));
    }
  }
  xSemaphoreGive(s_sd_mount_mutex);
}

esp_err_t app_storage_save_image(const uint8_t *jpeg_data, size_t jpeg_len) {
  if (!jpeg_data || jpeg_len == 0) {
    ESP_LOGE(TAG, "Invalid parameters");
    return ESP_ERR_INVALID_ARG;
  }

  // Validate JPEG
  if (!validate_jpeg(jpeg_data, jpeg_len)) {
    ESP_LOGE(TAG, "Invalid JPEG data (missing FF D8 marker)");
    return ESP_ERR_INVALID_ARG;
  }

  // Check if SD card is present
  if (!bsp_sdcard_is_present()) {
    ESP_LOGD(TAG, "SD card not present, skipping save");
    return ESP_ERR_NOT_FOUND;
  }

  // Check available memory before attempting mount
  // FATFS may need contiguous internal memory (not PSRAM) for buffers
  size_t free_heap = esp_get_free_heap_size();
  size_t free_internal = esp_get_free_internal_heap_size();
  size_t largest_free_block =
      heap_caps_get_largest_free_block(MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT);
  size_t min_free_heap = 80 * 1024; // Need at least 80KB free for SD mount
  size_t min_free_internal =
      32 * 1024;                     // FATFS needs contiguous internal memory
  size_t min_contiguous = 64 * 1024; // CRITICAL: Need at least 64KB contiguous
                                     // block for FATFS DMA buffers

  ESP_LOGI(TAG,
           "Memory check - Total: %u bytes, Internal: %u bytes, Largest "
           "contiguous: %u bytes",
           (unsigned)free_heap, (unsigned)free_internal,
           (unsigned)largest_free_block);

  if (free_heap < min_free_heap) {
    ESP_LOGW(TAG,
             "Insufficient total memory for SD mount: %u bytes free (need %u). "
             "Image not saved.",
             (unsigned)free_heap, (unsigned)min_free_heap);
    return ESP_ERR_NO_MEM;
  }

  if (free_internal < min_free_internal ||
      largest_free_block < min_contiguous) {
    ESP_LOGW(TAG,
             "Insufficient internal/contiguous memory: free=%u (need %u), "
             "largest_block=%u (need %u). FATFS requires 64KB contiguous "
             "internal memory for DMA buffers.",
             (unsigned)free_internal, (unsigned)min_free_internal,
             (unsigned)largest_free_block, (unsigned)min_contiguous);
    ESP_LOGW(
        TAG,
        "SD mount will fail. Memory fragmented by network/audio processing. "
        "SD should have been mounted after camera init.");
    return ESP_ERR_NO_MEM;
  }

  // Lazy mount: Mount SD card only when needed (not at boot to avoid ISP
  // conflict) The SDMMC host is already initialized by ESP-Hosted (C6
  // communication), but mounting the SD card filesystem conflicts with ISP
  // initialization. Mount only when actually saving a file.
  if (!s_sd_mounted) {
    ESP_LOGI(TAG, "Mounting SD card for image save...");

    // Add delay to ensure camera/ISP is fully initialized and stable
    vTaskDelay(pdMS_TO_TICKS(200));

    esp_err_t ret = bsp_sdcard_mount();
    if (ret != ESP_OK) {
      ESP_LOGW(TAG,
               "Failed to mount SD card: %s (heap: %u bytes). "
               "Will retry on next save attempt.",
               esp_err_to_name(ret), (unsigned)free_heap);
      return ESP_FAIL;
    }
    s_sd_mounted = true;
    ensure_directory_structure();
    ESP_LOGI(TAG, "SD card mounted successfully for save operation");
  }

  // Ensure directories exist
  esp_err_t ret = ensure_directory_structure();
  if (ret != ESP_OK) {
    ESP_LOGW(TAG, "Failed to ensure directories");
    // Continue anyway, might already exist
  }

  // Generate filename with timestamp
  char filename[128];
  time_t now = time(NULL);
  struct tm timeinfo;

  if (localtime_r(&now, &timeinfo) == NULL) {
    ESP_LOGE(TAG, "Failed to get local time");
    return ESP_FAIL;
  }

  snprintf(filename, sizeof(filename), "%s/IMG_%04d%02d%02d_%02d%02d%02d.jpg",
           SD_IMAGES_PATH, timeinfo.tm_year + 1900, timeinfo.tm_mon + 1,
           timeinfo.tm_mday, timeinfo.tm_hour, timeinfo.tm_min,
           timeinfo.tm_sec);

  FILE *f = fopen(filename, "wb");
  if (!f) {
    ESP_LOGE(TAG, "Failed to open file for writing: %s (errno: %d, %s)",
             filename, errno, strerror(errno));
    return ESP_FAIL;
  }

  // Write JPEG data
  size_t written = fwrite(jpeg_data, 1, jpeg_len, f);
  fclose(f);

  if (written != jpeg_len) {
    ESP_LOGE(TAG, "Failed to write complete file: %s (written: %u/%u bytes)",
             filename, (unsigned)written, (unsigned)jpeg_len);
    return ESP_FAIL;
  }

  ESP_LOGI(TAG, "Image saved successfully: %s (%u bytes)", filename,
           (unsigned)jpeg_len);
  return ESP_OK;
}

bool app_storage_is_ready(void) { return bsp_sdcard_is_present(); }

