marcelinoandrade/ExpertOnDevice-AI/firmware/esp32_p4_firmware/components/app/src/app_storage.c
esp_err_t app_storage_queue_image(const uint8_t *jpeg_data, size_t jpeg_len) {
  if (!jpeg_data || jpeg_len == 0) {
    ESP_LOGE(TAG, "Invalid parameters for queue");
    return ESP_ERR_INVALID_ARG;
  }

  // Validate JPEG
  if (!validate_jpeg(jpeg_data, jpeg_len)) {
    ESP_LOGE(TAG, "Invalid JPEG data (missing FF D8 marker)");
    return ESP_ERR_INVALID_ARG;
  }

  // Check queue capacity
  if (s_queue_mutex == NULL ||
      xSemaphoreTake(s_queue_mutex, pdMS_TO_TICKS(1000)) != pdTRUE) {
    ESP_LOGW(TAG, "Queue mutex unavailable, dropping frame");
    return ESP_FAIL;
  }

  if (s_queue_count >= MAX_QUEUED_IMAGES) {
    ESP_LOGW(TAG, "Image queue full (%d images), dropping oldest",
             s_queue_count);
    // Free oldest image
    if (s_image_queue[s_queue_head].valid && s_image_queue[s_queue_head].data) {
      free(s_image_queue[s_queue_head].data);
      s_image_queue[s_queue_head].data = NULL;
      s_image_queue[s_queue_head].valid = false;
      s_image_queue[s_queue_head].len = 0;
      s_image_queue[s_queue_head].timestamp = 0;
    }
    s_queue_head = (s_queue_head + 1) % MAX_QUEUED_IMAGES;
    s_queue_count--;
  }

  // Check JPEG size limit
  if (jpeg_len > MAX_JPEG_SIZE) {
    ESP_LOGW(TAG, "JPEG too large (%u bytes, max %u), truncating",
             (unsigned)jpeg_len, (unsigned)MAX_JPEG_SIZE);
    jpeg_len = MAX_JPEG_SIZE;
  }

  // Allocate buffer in PSRAM for JPEG data
  uint8_t *buffer =
      heap_caps_malloc(jpeg_len, MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT);
  if (!buffer) {
    ESP_LOGE(TAG, "Failed to allocate PSRAM buffer for JPEG (%u bytes)",
             (unsigned)jpeg_len);
    xSemaphoreGive(s_queue_mutex);
    return ESP_ERR_NO_MEM;
  }

  // Copy JPEG data to PSRAM buffer
  memcpy(buffer, jpeg_data, jpeg_len);

  // Add to queue with timestamp
  s_image_queue[s_queue_tail].data = buffer;
  s_image_queue[s_queue_tail].len = jpeg_len;
  s_image_queue[s_queue_tail].valid = true;
  s_image_queue[s_queue_tail].timestamp = time(NULL);
  s_queue_tail = (s_queue_tail + 1) % MAX_QUEUED_IMAGES;
  s_queue_count++;

  ESP_LOGI(TAG, "JPEG queued in PSRAM (%u bytes, queue: %d/%d)",
           (unsigned)jpeg_len, s_queue_count, MAX_QUEUED_IMAGES);

  const bool trigger_immediate =
      (s_queue_count >= MIN_QUEUE_FOR_IMMEDIATE_SAVE);
  xSemaphoreGive(s_queue_mutex);

  // Check if queue is almost full - trigger immediate save
  if (trigger_immediate && s_save_task_handle != NULL) {
    ESP_LOGW(TAG, "Queue almost full, triggering immediate save");
    xTaskNotifyGive(s_save_task_handle);
  }

  return ESP_OK;
}

// Legacy function - now just notifies interaction
// Actual saving happens opportunistically via task
void app_storage_process_queue(void) {
  // Just notify that interaction occurred
  // The opportunistic task will handle saving when idle
  app_storage_notify_interaction();
}

void app_storage_notify_interaction(void) {
  // Reset inactivity timer when user interacts
  // This prevents saving during active use
  if (s_inactivity_timer != NULL &&
      xTimerIsTimerActive(s_inactivity_timer) != pdFALSE) {
    BaseType_t timer_ret = xTimerReset(s_inactivity_timer, 0);
    if (timer_ret != pdPASS) {
      ESP_LOGW(TAG, "Failed to reset inactivity timer on interaction");
    }
  }
}

int app_storage_get_queue_count(void) { return app_queue_get_count(); }

bool app_storage_is_busy(void) { return s_storage_busy; }

/* -----------------------------------------------------------------------
 * WAV helper – build a minimal 44-byte RIFF/PCM header in-place.
 * 16-bit, mono, PCM (format tag 1).
 * ----------------------------------------------------------------------- */
static void build_wav_header(uint8_t *hdr, uint32_t pcm_bytes,
                             uint32_t sample_rate_hz) {
  const uint16_t num_channels = 1;
  const uint16_t bits_per_sample = 16;
  const uint32_t byte_rate =
      sample_rate_hz * num_channels * (bits_per_sample / 8);
  const uint16_t block_align = num_channels * (bits_per_sample / 8);
  const uint32_t data_chunk_size = pcm_bytes;
  const uint32_t riff_size =
      36 + pcm_bytes; /* 36 = rest of header after RIFF */

  /* RIFF chunk */
  memcpy(hdr, "RIFF", 4);
  hdr[4] = (uint8_t)(riff_size);
  hdr[5] = (uint8_t)(riff_size >> 8);
  hdr[6] = (uint8_t)(riff_size >> 16);
  hdr[7] = (uint8_t)(riff_size >> 24);
  memcpy(hdr + 8, "WAVE", 4);

  /* fmt sub-chunk */
  memcpy(hdr + 12, "fmt ", 4);
  hdr[16] = 16;
  hdr[17] = 0;
  hdr[18] = 0;
  hdr[19] = 0; /* sub-chunk size = 16 */
  hdr[20] = 1;
  hdr[21] = 0; /* PCM = 1 */
  hdr[22] = (uint8_t)(num_channels);
  hdr[23] = (uint8_t)(num_channels >> 8);
  hdr[24] = (uint8_t)(sample_rate_hz);
  hdr[25] = (uint8_t)(sample_rate_hz >> 8);
  hdr[26] = (uint8_t)(sample_rate_hz >> 16);
  hdr[27] = (uint8_t)(sample_rate_hz >> 24);
  hdr[28] = (uint8_t)(byte_rate);
  hdr[29] = (uint8_t)(byte_rate >> 8);
  hdr[30] = (uint8_t)(byte_rate >> 16);
  hdr[31] = (uint8_t)(byte_rate >> 24);
  hdr[32] = (uint8_t)(block_align);
  hdr[33] = (uint8_t)(block_align >> 8);
  hdr[34] = (uint8_t)(bits_per_sample);
  hdr[35] = (uint8_t)(bits_per_sample >> 8);

  /* data sub-chunk */
  memcpy(hdr + 36, "data", 4);
  hdr[40] = (uint8_t)(data_chunk_size);
  hdr[41] = (uint8_t)(data_chunk_size >> 8);
  hdr[42] = (uint8_t)(data_chunk_size >> 16);
  hdr[43] = (uint8_t)(data_chunk_size >> 24);
}

/* -----------------------------------------------------------------------
 * Ensure SD is mounted (reuses the already-mounted state to avoid DMA
 * fragmentation).  Returns ESP_OK only when mount is confirmed.
 * ----------------------------------------------------------------------- */
static esp_err_t storage_ensure_mounted(void) {
  if (s_sd_mounted) {
    return ESP_OK;
  }
  if (!bsp_sdcard_is_present()) {
    return ESP_ERR_NOT_FOUND;
  }
  if (s_sd_mount_mutex == NULL) {
    return ESP_ERR_INVALID_STATE;
  }
  if (xSemaphoreTake(s_sd_mount_mutex, pdMS_TO_TICKS(2000)) != pdTRUE) {
    return ESP_ERR_TIMEOUT;
  }
  esp_err_t ret = ESP_OK;
  if (!s_sd_mounted) {
    ret = bsp_sdcard_mount();
    if (ret == ESP_OK) {
      s_sd_mounted = true;
      (void)ensure_directory_structure();
      ESP_LOGI(TAG, "SD mounted on-demand");
    } else {
      ESP_LOGW(TAG, "SD mount failed: %s", esp_err_to_name(ret));
    }
  }
  xSemaphoreGive(s_sd_mount_mutex);
  return ret;
}

/* -----------------------------------------------------------------------
 * app_storage_save_audio
 * ----------------------------------------------------------------------- */
esp_err_t app_storage_save_audio(const uint8_t *pcm_data, size_t pcm_bytes,
                                 uint32_t sample_rate_hz) {
  if (!pcm_data || pcm_bytes == 0) {
    return ESP_ERR_INVALID_ARG;
  }

  esp_err_t ret = storage_ensure_mounted();
  if (ret != ESP_OK) {
    ESP_LOGW(TAG, "save_audio: SD not available (%s)", esp_err_to_name(ret));
    return ret;
  }

  /* Build timestamp filename */
  char filename[128];
  time_t now = time(NULL);
  struct tm ti;
  if (localtime_r(&now, &ti) == NULL) {
    ESP_LOGE(TAG, "save_audio: failed to get local time");
    return ESP_FAIL;
  }
  snprintf(filename, sizeof(filename), "%s/REC_%04d%02d%02d_%02d%02d%02d.wav",
           SD_MEDIA_PATH "/audio", ti.tm_year + 1900, ti.tm_mon + 1, ti.tm_mday,
           ti.tm_hour, ti.tm_min, ti.tm_sec);

  FILE *f = fopen(filename, "wb");
  if (!f) {
    ESP_LOGE(TAG, "save_audio: fopen failed '%s' (errno %d: %s)", filename,
             errno, strerror(errno));
    return ESP_FAIL;
  }

