marcelinoandrade/ExpertOnDevice-AI/firmware/esp32_p4_firmware/components/app/src/app_storage.c
  /* Write WAV header */
  uint8_t wav_hdr[44];
  build_wav_header(wav_hdr, (uint32_t)pcm_bytes, sample_rate_hz);
  size_t hdr_written = fwrite(wav_hdr, 1, sizeof(wav_hdr), f);

  /* Write PCM payload */
  size_t pcm_written = fwrite(pcm_data, 1, pcm_bytes, f);
  fclose(f);

  if (hdr_written != sizeof(wav_hdr) || pcm_written != pcm_bytes) {
    ESP_LOGE(TAG, "save_audio: incomplete write to '%s' (hdr=%u/%u, pcm=%u/%u)",
             filename, (unsigned)hdr_written, (unsigned)sizeof(wav_hdr),
             (unsigned)pcm_written, (unsigned)pcm_bytes);
    return ESP_FAIL;
  }

  ESP_LOGI(TAG, "Audio saved: %s (%u bytes PCM -> %u bytes WAV)", filename,
           (unsigned)pcm_bytes, (unsigned)(sizeof(wav_hdr) + pcm_bytes));
  return ESP_OK;
}

/* -----------------------------------------------------------------------
 * app_storage_save_chat_log
 * ----------------------------------------------------------------------- */
esp_err_t app_storage_save_chat_log(const char *mode_label,
                                    const char *ai_response) {
  if (!mode_label || !ai_response) {
    return ESP_ERR_INVALID_ARG;
  }

  esp_err_t ret = storage_ensure_mounted();
  if (ret != ESP_OK) {
    ESP_LOGW(TAG, "save_chat_log: SD not available (%s)", esp_err_to_name(ret));
    return ret;
  }

  /* Daily log file: CHAT_YYYYMMDD.txt */
  char filename[128];
  time_t now = time(NULL);
  struct tm ti;
  if (localtime_r(&now, &ti) == NULL) {
    ESP_LOGE(TAG, "save_chat_log: failed to get local time");
    return ESP_FAIL;
  }
  snprintf(filename, sizeof(filename), "%s/CHAT_%04d%02d%02d.txt",
           SD_BASE_PATH "/logs/chat", ti.tm_year + 1900, ti.tm_mon + 1,
           ti.tm_mday);

  /* Append mode: cria o arquivo se não existir, senão acrescenta */
  FILE *f = fopen(filename, "a");
  if (!f) {
    ESP_LOGE(TAG, "save_chat_log: fopen failed '%s' (errno %d: %s)", filename,
             errno, strerror(errno));
    return ESP_FAIL;
  }

  /* Format: [HH:MM:SS] [MODE] AI: <response>\n */
  char timestamp[24];
  snprintf(timestamp, sizeof(timestamp), "%02d:%02d:%02d", ti.tm_hour,
           ti.tm_min, ti.tm_sec);

  int written =
      fprintf(f, "[%s] [%s] AI: %s\n", timestamp, mode_label, ai_response);
  fclose(f);

  if (written < 0) {
    ESP_LOGE(TAG, "save_chat_log: fprintf failed for '%s'", filename);
    return ESP_FAIL;
  }

  ESP_LOGI(TAG, "Chat log appended: %s (%d bytes)", filename, written);
  return ESP_OK;
}
